---
kind: method
id: M:Autodesk.Revit.DB.HostedSweep.AddSegment(Autodesk.Revit.DB.Reference)
source: html/c26f908b-140a-6f06-918d-263efe814df9.htm
---
# Autodesk.Revit.DB.HostedSweep.AddSegment Method

Add segments to the hosted sweep object.

## Syntax (C#)
```csharp
public abstract void AddSegment(
	Reference targetRef
)
```

## Parameters
- **targetRef** (`Autodesk.Revit.DB.Reference`)